<a href="https://colab.research.google.com/github/Mehadi2012/Data-Science-in-Practice/blob/main/merging_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

staff = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                      {'Name': 'Sally', 'Role': 'Course liasion'},
                      {'Name': 'James', 'Role': 'Grader'}])

staff = staff.set_index('Name')
student = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                      {'Name': 'Mike', 'School': 'Law'},
                      {'Name': 'Sally', 'School': 'Engineering'}])
student = student.set_index('Name')

print(staff.head())
print(student.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [3]:
pd.merge(staff, student, how='outer', left_index = True, right_index = True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [5]:
pd.merge(staff, student, how = 'inner', left_index = True, right_index = True)        # to get the intersection

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [7]:
pd.merge(staff, student, how = 'left', left_index = True, right_index = True)   #checking whether the staffs were students or not

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [9]:
pd.merge(staff, student, how = 'right', left_index = True, right_index = True)     #checking whether the student were staffs or not

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [10]:
staff = staff.reset_index()
student = student.reset_index()

pd.merge(staff, student, how = 'right', on ='Name')

    Name            Role       School
0  James          Grader     Business
1   Mike             NaN          Law
2  Sally  Course liasion  Engineering

In [11]:
staff = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                      {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington'},
                      {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington'}])

student = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                      {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                      {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])

pd.merge(staff, student, how='left', on='Name')

    Name            Role    Location_x       School            Location_y
0  Kelly  Director of HR  State Street          NaN                   NaN
1  Sally  Course liasion    Washington  Engineering   512 Wilson Crescent
2  James          Grader    Washington     Business  1024 Billiard Avenue

In [12]:
staff = pd.DataFrame([{'First Name': 'Kelly','Last Name':'Desjardins', 'Role': 'Director of HR'},
                      {'First Name': 'Sally','Last Name':'Brooks', 'Role': 'Course liasion'},
                      {'First Name': 'James','Last Name':'Wilde', 'Role': 'Grader'}])


student = pd.DataFrame([{'First Name': 'James','Last Name':'Hammond', 'School': 'Business'},
                      {'First Name': 'Mike','Last Name':'Smith', 'School': 'Law'},
                      {'First Name': 'Sally','Last Name':'Brooks', 'School': 'Engineering'}])

pd.merge(staff, student, how='inner', on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering